// Створіть змінну str і дайте їй значення 'abcde'. Звертаючись до окремих символів цього рядка,
// //виведіть на екран символ 'a', символ 'b', символ 'e'.

// const str = "abcde";

// alert(str[0]);
// alert(str[1]);
// alert(str[4]);

//Задача 2. Напишите скрипт, который считает количество секунд в часе.

// const hours = Number(prompt("Enter hours"));

// if (hours === 0) {
//   alert("No information.");
// } else {
//   const seconds = hours * 3600;
// }

// const seconds = hours * 3600;
// alert(seconds);

// Переробите наведений код так, щоб у ньому використовувалися операції +=, -=, *=, /=, ++, --.
//Кількість рядків коду не повинна змінитися. Код для переробки:
// let num = 1;
// num = num + 12;
// num = num - 14;
// num = num * 5;
// num = num / 7;
// num = num + 1;
// num = num - 1;

// let num = 1;
// num += 12;
// num -= 14;
// num *= 5;
// num /= 7;
// num += 1;
// num -= 1;

// alert("result:" + num);

// Напишіть інструкцию, яка приймає рядок як аргумент і перетворює регістр першого
// символу рядка з нижнього регістру у верхній.

// const str = "string not starting with capital";
// const newStr = str[0].toUpperCase() + str.slice(1);

// console.log(newStr);

//// Завдання 5. Ви просите користувача ввести суму його зарплати. Потім розраховуєте:

// Добавку у вигляді премії у сумі 15% від зарплати.
// Податки у сумі 10% від суми всіх нарахувань (зарплата + премія).
// Витрату в магазині в сумі 190.
// Розділяєте суму, що залишилася, між користувачем і його "дружиною"/"чоловіком".

// Виводьте скільки залишилося в результаті всіх операцій грошей у користувача.

// let salary = Number(prompt("What your salary?"));
// salary *= 1.15;
// salary = Math.floor(salary);

// alert(`premia: ${salary}`);

// salary -= salary * 0.1;
// salary = Math.floor(salary);

// alert(`clear: ${salary}`);

// salary -= 190;
// salary = Math.floor(salary);

// alert(`after shop: ${salary}`);

// salary /= 2;
// salary = Math.floor(salary);

// alert(`the end: ${salary}`);

//// Завдання 6. Потрібно попросити користувача задумати число. Потім він повинен помножити це число на 2 і додати отриманого результату 7.
// Те, що сталося в результаті, потрібно ввести в діалоговому вікні prompt().
// Ви повинні видати користувачеві, скільки він задумав.

// const message =
//   "Загадайте число і помножити його на 2 і додати до результату число 7.";

// let result = Number(prompt(message));

// result = (result - 7) / 2;
// const answer = confirm(` Ви загадали число ${result}?`);

// if (answer) {
//   alert("Ми вгадали ваше число!");
// } else {
//   alert("Ви збрехали, ми вгадали!");
// }

//// Завдання 7. Попросіть користувача ввести 3 імені та прізвища, наприклад, студентів.
// Виведіть введені дані методом console.log
// у вигляді абзаців та нумерованого списку.

// const name1 = prompt("Напишіть імя та прізвища.");
// const name2 = prompt("Напишіть імя та прізвища.");
// const name3 = prompt("Напишіть імя та прізвища.");

// // перенос рядка

// console.log(`1: ${name1}\n2: ${name2}\n3: ${name3}`);

//За допомогою методу prompt() отримайте спочатку ім'я користувача,
// потім рік народження і збережіть у 2 змінні. Обчисліть вік користувача та виведіть
// його в абзаці за допомогою alert() у такому форматі "Антон: 24".

// const name = prompt("Напишіть своє імя.");
// let year = Number(prompt("Якого Ви року?"));

// const age = 2022;

// console.log(`${name}: ${age - year}`);
